#ifndef RE2RR_TYPES_H
#define RE2RR_TYPES_H

#include "Common.h"
#include <array>
#include <functional>
#include <memory>
#include <rpc.h>
#include <stdint.h>
#include <string>
#include <vector>
#include <windows.h>

#ifdef UNICODE
#define TryStringToGUID TryStringToGUIDW
#else
#define TryStringToGUID TryStringToGUIDA
#endif
bool TryStringToGUIDA(const std::string &stringGUID, const GUID &guid);
bool TryStringToGUIDW(const std::wstring &stringGUID, const GUID &guid);

#ifdef UNICODE
#define StringToGUID StringToGUIDW
#else
#define StringToGUID StringToGUIDA
#endif
GUID &StringToGUIDA(const std::string &stringGUID);
GUID &StringToGUIDW(const std::wstring &stringGUID);

// Enum RE2RGameVersion
#ifndef RE2RR_TYPES_H_RE2RGameVersion
#define RE2RR_TYPES_H_RE2RGameVersion
#define ENUM_NAME RE2RGameVersion
#define ENUM_TYPE uint32_t
#define ENUM_LIST                        \
	ENUM_VALUE(Unknown, 0)               \
	ENUM_VALUE(WW_DX11_20230421_1, 1)    \
	ENUM_VALUE(WW_DX12_20230814_1, 2)    \
	ENUM_VALUE(CEROZ_DX11_20230421_1, 3) \
	ENUM_VALUE(CEROZ_DX12_20230814_1, 4)
#ifdef RE2RR_TYPES_CPP
#include "../src/Types_Enum.cpp"
#else
#include "Types_Enum.h"
#endif
#undef ENUM_LIST
#undef ENUM_TYPE
#undef ENUM_NAME
#endif
//

// Enum Scenario (app.ropeway.gamemastering.MainFlowManager.ScenarioType)
#ifndef RE2RR_TYPES_H_Scenario
#define RE2RR_TYPES_H_Scenario
#define ENUM_NAME Scenario
#define ENUM_TYPE int32_t

	ENUM_VALUE(IDWristbandGeneralStaff2, 0xC9)      \
	ENUM_VALUE(IDWristbandSeniorStaff2, 0xCA)       \
	ENUM_VALUE(LabDigitalVideoCassette, 0xCB)       \
	ENUM_VALUE(Briefcase, 0xE6)                     \
	ENUM_VALUE(FuseMainHall, 0xF0)                  \
	ENUM_VALUE(FuseBreakRoom, 0xF1)                 \
	ENUM_VALUE(Scissors, 0xF3)                      \
	ENUM_VALUE(BoltCutter, 0xF4)                    \
	ENUM_VALUE(StuffedDoll, 0xF5)                   \
	ENUM_VALUE(HipPouch, 0x0106)                    \
	ENUM_VALUE(OldKey, 0x011E)                      \
	ENUM_VALUE(PortableSafe, 0x0123)                \
	ENUM_VALUE(TinStorageBox1, 0x0125)              \
	ENUM_VALUE(WoodenBox1, 0x0126)                  \
	ENUM_VALUE(WoodenBox2, 0x0127)                  \
	ENUM_VALUE(TinStorageBox2, 0x0128)
#ifdef RE2RR_TYPES_CPP
#include "../src/Types_Enum.cpp"
#else
#include "Types_Enum.h"
#endif
#undef ENUM_LIST
#undef ENUM_TYPE
#undef ENUM_NAME
#endif
//

// Enum WeaponType
#ifndef RE2RR_TYPES_H_WeaponType
#define RE2RR_TYPES_H_WeaponType
#define ENUM_NAME WeaponType
#define ENUM_TYPE int32_t
#define ENUM_LIST                                       \
	ENUM_VALUE(None, (int32_t)0xFFFFFFFF)               \
	ENUM_VALUE(Handgun_Matilda, 0x01)                   \
	ENUM_VALUE(Handgun_M19, 0x02)                       \
	ENUM_VALUE(Handgun_JMB_Hp3, 0x03)                   \
	ENUM_VALUE(Handgun_Quickdraw_Army, 0x04)            \
	ENUM_VALUE(Handgun_MUP, 0x07)                       \
	ENUM_VALUE(Handgun_BroomHc, 0x08)                   \
	ENUM_VALUE(Handgun_SLS60, 0x09)                     \
	ENUM_VALUE(Shotgun_W870, 0x0B)                      \
	ENUM_VALUE(SMG_MQ11, 0x15)                          \
	ENUM_VALUE(SMG_LE5_Infinite, 0x17)                  \
	ENUM_VALUE(Handgun_LightningHawk, 0x1F)             \
	ENUM_VALUE(EMF_Visualizer, 0x29)                    \
	ENUM_VALUE(GrenadeLauncher_GM79, 0x2A)              \
	ENUM_VALUE(ChemicalFlamethrower, 0x2B)              \
	ENUM_VALUE(SparkShot, 0x2C)                         \
	ENUM_VALUE(ATM4, 0x2D)                              \
	ENUM_VALUE(CombatKnife, 0x2E)                       \
	ENUM_VALUE(CombatKnife_Infinite, 0x2F)              \
	ENUM_VALUE(AntiTankRocketLauncher, 0x31)            \
	ENUM_VALUE(Minigun, 0x32)                           \
	ENUM_VALUE(HandGrenade, 0x41)                       \
	ENUM_VALUE(FlashGrenade, 0x42)                      \
	ENUM_VALUE(Handgun_SamuraiEdge_Infinite, 0x52)      \
	ENUM_VALUE(Handgun_SamuraiEdge_ChrisRedfield, 0x53) \
	ENUM_VALUE(Handgun_SamuraiEdge_JillValentine, 0x54) \
	ENUM_VALUE(Handgun_SamuraiEdge_AlbertWesker, 0x55)  \
	ENUM_VALUE(ATM4_Infinite, 0xDE)                     \
	ENUM_VALUE(AntiTankRocketLauncher_Infinite, 0xF2)   \
	ENUM_VALUE(Minigun_Infinite, 0xFC)
#ifdef RE2RR_TYPES_CPP
#include "../src/Types_Enum.cpp"
#else
#include "Types_Enum.h"
#endif
#undef ENUM_LIST
#undef ENUM_TYPE
#undef ENUM_NAME
#endif
//

struct PACKED_DATA via_vec3
{
	float x; // 0x00-0x0F
	float y; // 0x10-0x13
	float z; // 0x14-0x17

	std::unique_ptr<std::string> ToString() const
	{
		const char *toStringFormat = ".%s = %f, .%s = %f, .%s = %f";

		int bufferSize = snprintf(NULL, 0, toStringFormat,
		                          NAMEOF(x), x,
		                          NAMEOF(y), y,
		                          NAMEOF(z), z) +
		                 1;
		std::unique_ptr<char[]> toString = std::make_unique<char[]>(bufferSize);
		snprintf(toString.get(), bufferSize, toStringFormat,
		         NAMEOF(x), x,
		         NAMEOF(y), y,
		         NAMEOF(z), z);

		return std::make_unique<std::string>(toString.get());
	}
};

struct PACKED_DATA app_ropeway_MansionManager_MapIdentifier
{
	uint8_t _Reserved[0x10];  // 0x00-0x0F
	RE2RREnums::MapID ID;     // 0x10-0x13
	RE2RREnums::MapArea Area; // 0x14-0x17

	std::unique_ptr<std::string> ToString() const
	{
		const char *toStringFormat = ".%s = %s, .%s = %s";

		int bufferSize = snprintf(NULL, 0, toStringFormat,
		                          NAMEOF(ID), RE2RREnums::EnumMapIDToString(ID).get()->c_str(),
		                          NAMEOF(Area), RE2RREnums::EnumMapAreaToString(Area).get()->c_str()) +
		                 1;
		std::unique_ptr<char[]> toString = std::make_unique<char[]>(bufferSize);
		snprintf(toString.get(), bufferSize, toStringFormat,
		         NAMEOF(ID), RE2RREnums::EnumMapIDToString(ID).get()->c_str(),
		         NAMEOF(Area), RE2RREnums::EnumMapAreaToString(Area).get()->c_str());

		return std::make_unique<std::string>(toString.get());
	}
};

typedef struct PACKED_DATA app_ropeway_gamemastering_InventoryManager_PrimitiveItem
{
	// uint8_t _Reserved[0x10]; // 0x00-0x0F
	RE2RREnums::ItemType ItemId;     // 0x10-0x13
	RE2RREnums::WeaponType WeaponId; // 0x14-0x17
	int32_t WeaponParts;             // 0x18-0x1B
	int32_t BulletId;                // 0x1C-0x1F
	int32_t Count;                   // 0x20-0x23

	std::unique_ptr<std::string> ToString() const
	{
		const char *toStringFormat = ".%s = %s, .%s = %s, .%s = %d, .%s = %d, .%s = %d";

		int bufferSize = snprintf(NULL, 0, toStringFormat,
		                          NAMEOF(ItemId), RE2RREnums::EnumItemTypeToString(ItemId).get()->c_str(),
		                          NAMEOF(WeaponId), RE2RREnums::EnumWeaponTypeToString(WeaponId).get()->c_str(),
		                          NAMEOF(WeaponParts), WeaponParts,
		                          NAMEOF(BulletId), BulletId,
		                          NAMEOF(Count), Count) +
		                 1;
		std::unique_ptr<char[]> toString = std::make_unique<char[]>(bufferSize);
		snprintf(toString.get(), bufferSize, toStringFormat,
		         NAMEOF(ItemId), RE2RREnums::EnumItemTypeToString(ItemId).get()->c_str(),
		         NAMEOF(WeaponId), RE2RREnums::EnumWeaponTypeToString(WeaponId).get()->c_str(),
